{
    "directed": true,
    "multigraph": false,
    "graph": {},
    "nodes": [
        {
            "type": "concept",
            "id": "AI"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "This paper presents a comprehensive overview of neurosymbolic AI, a rapidly emerging field that combines the strengths of logical and neural representations to enable principled integration of reasoning and learning in deep networks"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "We propose a formal definition of neurosymbolic AI as the computation of an integral over a product of a logical and a belief function"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "We also introduce a neurosymbolic AI system that can represent and reason formally about any propositional logic formula, addressing challenges in data efficiency, fairness, and safety of Large Language Models"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "Furthermore, we conduct a literature survey of neurosymbolic reinforcement learning, categorizing works into three taxonomies and analyzing the RL components of each research work to identify research opportunities and challenges"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "Additionally, we introduce relational neurosymbolic Markov models, a new class of end-to-end differentiable sequential models that integrate and provably satisfy relational logical constraints"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "Our contributions include a complexity map for probabilistic reasoning problems, a language for neurosymbolic programming, and a framework for assurance of end-to-end fully differentiable neurosymbolic systems"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "We also explore the potential of neurosymbolic AI for defending against cyber attacks and reimagine software engineering automation via a neurosymbolic paradigm."
        },
        {
            "type": "claim",
            "cited": false,
            "id": "The integration of learning and reasoning is a long-standing challenge in Artificial Intelligence (AI)"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "Neurosymbolic AI, a subfield of AI that combines logical and neural representations, has emerged as a promising approach to address this challenge"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "However, despite its growing popularity, neurosymbolic AI lacks a universally accepted definition, leading to confusion and fragmentation in the research community"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "This paper aims to address this gap by proposing a formal definition of neurosymbolic AI and exploring its applications in scientific reasoning and automated writing.\n\nIn recent years, there has been a surge of interest in neurosymbolic AI, driven by its potential to combine the strengths of neural networks and symbolic systems"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "This integration enables the representation and reasoning about complex logical formulas, which is essential for many real-world applications, such as scientific discovery, automated writing, and decision-making under uncertainty"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "However, the development of neurosymbolic AI systems is hindered by several challenges, including data efficiency, fairness, and safety.\n\nTo address these challenges, we propose a neurosymbolic AI system that can represent and reason formally about any propositional logic formula, combining learning from data and knowledge with logical reasoning"
        },
        {
            "type": "concept",
            "id": "model"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "We also conduct a literature survey of neurosymbolic reinforcement learning, categorizing works into three taxonomies and analyzing the RL components of each research work to identify research opportunities and challenges.\n\nFurthermore, we introduce relational neurosymbolic Markov models, a new class of end-to-end differentiable sequential models that integrate and provably satisfy relational logical constraints"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "These models can solve problems beyond the current state-of-the-art in neurosymbolic AI and provide strong guarantees with respect to desired properties, while also being more interpretable and adaptable to out-of-distribution scenarios.\n\nIn addition, we develop a unified formalism for probabilistic reasoning problems and create a complexity map to assess the scalability of neurosymbolic techniques, helping practitioners navigate the scalability landscape"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "We also present Scallop, a language that combines deep learning and logical reasoning, enabling users to write and train neurosymbolic applications efficiently.\n\nThis paper contributes to the development of neurosymbolic AI by proposing a formal definition, exploring its applications in scientific reasoning and automated writing, and introducing new models and techniques that can solve complex problems"
        },
        {
            "type": "claim",
            "cited": false,
            "id": "Our work has the potential to promote the principled integration of reasoning and learning in deep networks, enabling the development of more accurate, efficient, and interpretable AI systems."
        }
    ],
    "links": [
        {
            "relation": "supports",
            "source": "AI",
            "target": "model"
        }
    ]
}